app/Models/Carrito_model.php

	public function ver_compra(){
		$db = \Config\Database::connect();
		$builder = $db->table('ventas_cabecera');
		$builder->select('*');
		$builder->join('usuarios', 'ventas_cabecera.usuario_id = usuarios.id_usuario');
		$query = $builder->get();
---
SELECT *
FROM `ventas_cabecera`
JOIN `usuarios` ON `ventas_cabecera`.`usuario_id` = `usuarios`.`id_usuario`