app/Models/DetalleV_model.php

SELECT *
FROM `ventas_detalle`
JOIN `productos` ON `ventas_detalle`.`producto_id` = `productos`.`id_producto`
JOIN `ventas_cabecera` ON `ventas_cabecera`.`id_ventas` = `ventas_detalle`.`venta_id`
JOIN `usuarios` ON `ventas_cabecera`.`usuario_id` = `usuarios`.`id_usuario`
WHERE `venta_id` = '14'
---
    public function ver_detalle($id){
        $db = \Config\Database::connect();
		$builder = $db->table('ventas_detalle');
		$builder->select('*');
		$builder->where('venta_id', $id);
        $builder->join('productos', 'ventas_detalle.producto_id = productos.id_producto');
        $builder->join('ventas_cabecera', 'ventas_cabecera.id_ventas = ventas_detalle.venta_id');
        $builder->join('usuarios', 'ventas_cabecera.usuario_id = usuarios.id_usuario');
        $query = $builder->get();