app/Models/Productos_model.php

    public function ver_productosA(){
        $db = \Config\Database::connect();
        $builder = $db->table('productos');
        $builder->select('*');
        $builder->join('categorias', 'categorias.id = productos.categoria_id');
        $builder->where('estado', '1');
        $query = $builder->get();
---
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
WHERE `estado` = '1'

    public function ver_bajaProductos(){
        $db = \Config\Database::connect();
        $builder = $db->table('productos');
        $builder->select('*');
        $builder->join('categorias', 'categorias.id = productos.categoria_id');
        $builder->where('estado', '0');
        $query = $builder->get();
---
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
WHERE `estado` = '0'

    public function seleccionar_categoria(){
        $db = \Config\Database::connect();
        $builder = $db->table('categorias');
        $builder->select('*');
        $query = $builder->get();
---
SELECT *
FROM `categorias`

	 public function seleccionar_categoria_sin_0(){
        $db = \Config\Database::connect();
        $builder = $db->table('categorias');
        $builder->select('*');
        $builder->where('id >', '0');
        $query = $builder->get();
---
SELECT *
FROM `categorias`
WHERE `id` > '0'